<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%
String path = request.getContextPath();
String basePath = request.getScheme()+"://"+request.getServerName()+":"+request.getServerPort()+path+"/";
%>
<!DOCTYPE html>
<html>
<head>
<base href="<%=basePath %>"/>
<title>手机宝贝网接口文档</title>
</head>
<body>
<div style="text-align:center">
	<h2>手机宝贝网接口文档</h2>
</div>
<h3>
	<a target="app_window" href="http://axure.app.xiaozhuschool.com/shoujibaobei02">手机宝贝网APP设计文档</a>
	<br/>
	<a target="pc_window" href="https://fqhkyp.axshare.com">手机宝贝网PC端设计文档</a>
</h3>
<hr/>
<h2>手机宝贝网项目功能点分析</h2>

<h4>1-登录,第三方登录,注册,忘记密码,找回密码</h4>
<h4>2-首页(商品首页)</h4>
3-商品详情<br/>

4-订单<br/>

5-收货地址<br/>

6-购物车<br/>

7-商品评论<br/>

8-店铺信息<br/>

9-结算<br/>

10-客服 IM聊天即时通讯<br/>

11-关键字搜索<br/>

12-内配<br/>

13-外配<br/>

14-数码<br/>

15-设备工具<br/>

16-整机/主板<br/>

17-辅料耗材<br/>

18-维修技术->视频详情->作者全集->点赞<br/>

19-上传视频->视频分类选择->确认发布->后台审核流程->前端显示<br/>

20-其他分类<br/>

<h4>21-咨询(咨询首页)</h4>

22-咨询详情<br/>

23-咨询列表<br/>

24-发布 (咨询文章内容及图片)<br/>

25-用户咨询列表->聊一聊<br/>

<h4>26-消息</h4>

27-互动详情<br/>

28-查看物流<br/>

<h4>29-购物车</h4>

30-管理(批量删除)<br/>

31-结算<br/>

<h4>32-我的</h4>

33-个人资料<br/>

34-所在地<br/>

35-我的发布<br/>

36-钱包<br/>

37-我的兑换券<br/>

38-明细<br/>

39-充值<br/>

40-提现<br/>

41-足迹<br/>

42-商品详情<br/>

43-礼品兑换区<br/>

44-物品详情<br/>

45-收货地址<br/>

46-兑换记录<br/>

47-我的订单<br/>

48-发表评论<br/>

49-联系客服<br/>

50-邀请好友<br/>

51-收藏<br/>

52-帮助中心<br/>

53-设置<br/>

54-关于我们<br/>

55-修改密码<br/>

56-申请成为商家<br/>

<hr/>

<h2>项目需求分析建议</h2>
<h4>退换货功能</h4>
<h4>新增厂家直销模块</h4>
<h4>兑换商品列表页数据不够明细 建议添加兑换商品详情页</h4>
<h4>商家店铺装修功能 对不同的产品商家可由商家自行美化或使用对应模板进行对店铺的美化</h4>
<h4>商家店内搜索功能 对不同店铺中的商品进行分类 对忠实某一个店铺的用户而言能够单纯搜索该店铺内的物品相当合适</h4>
<h4>店内外链功能  对对应联盟的店铺提供外链功能，可由A商家店铺直接跳转到B商家店铺</h4>
<h4>店铺收藏功能  用户可对自己相对满意及信任的店铺进行收藏 便于下一次购买</h4>
<h4>用户购买记录行为分析  -------后台针对用户行为进行分析排序，后期主要用于了解及对某用户可能购买的物品进行推荐</h4>
<h4>积分系统  用户积分系统(可理解为小额红包系统) 对于用户购买某类商品进行红包(优惠券)处理 让用户达到某一额度可使用，增加用户消费心理</h4>
<h4>附近的商铺  对于某类需求较急切的用户 为其提供商铺位置</h4>
<h4>个人中心中账期功能未明确  无法理解其功能点</h4>
<h4>商品分享功能  让用户可自行推荐对应的商品给朋友同事进行下单  同时商家一样可以通过该分析进行推广其商品</h4>
<h4>限时秒杀功能  上用户在某一时间段引起购买量的增加</h4>
<h4>拼团功能  多用户下单后才进行发货并相对应的优惠</h4>
</body>
</html>